Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/CH563USBSFR.H
/********************************** (C) COPYRIGHT *******************************
* File Name          : CH563USBSFE.H
* Author             : MJX
* Version            : V1.20
* Date               : 2013/08/12
* Description        : CH563 USB相关寄存器定义
*******************************************************************************/



#ifndef __CH563USBSFR_H__
#define __CH563USBSFR_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* usb addresses                                                              */
#define USB_BASE_ADDR              (0x00404000)

/**********************************************************************************************************************************************/
/************************* Host Controller Registers(Address = 0x000---0x07F) **************************/

/******************************************************************************/
/* EHCI Capability Registers */

/* HC Capability Register(Address = 0x000) */
#define HC_CAPLENGTH			   (*((PUINT32V)(USB_BASE_ADDR + 0x000)))	    // RO(32h01000010), HC Capability Register
#define R8_HC_CAPLENGTH			   (*((PUINT8V) (USB_BASE_ADDR + 0x000)))	    // RO(8h10), Capability Register Length
#define R16_HC_HCIVERSION		   (*((PUINT16V)(USB_BASE_ADDR + 0x003)))       // RO(16h0100), Host Controller Version Number  

/* HC Structural Register(Address = 0x004) */
#define HC_HCSPARAMS			   (*((PUINT32V)(USB_BASE_ADDR + 0x004)))	    // RO(32h00000001), HC Structural Parameters

/* HC Capability Register(Address = 0x008) */
#define HC_HCCPARAMS			   (*((PUINT32V)(USB_BASE_ADDR + 0x008)))	    // RO(32h00000006), HC Capability Parameters
#define  RB_ASYN_SCH_PARK_CAP      (1 << 2)                      		   	 	// RO(1b1), Asynchronous Schedule Park Capability
#define  RB_PROG_FR_LIST_FLAG      (1 << 1)                      		   		// RO(1b1), Programmable Frame List Flag

/******************************************************************************/
/* EHCI Operational Registers */

/* HC USB Command Register(Address = 0x010) */
#define HC_USBCMD			       (*((PUINT32V)(USB_BASE_ADDR + 0x010)))	    // RW(32h00080b00), HC USB Command Register

/* HC USB Status Register(Address = 0x014) */
#define HC_USBSTS			       (*((PUINT32V)(USB_BASE_ADDR + 0x014)))	    // RW(32h00001000), HC USB Status Register

/* HC USB Interrupt Enable Register(Address = 0x018) */
#define HC_USBINT_EN			   (*((PUINT32V)(USB_BASE_ADDR + 0x018)))	    // RW(32h00000000), HC USB Interrupt Enable Register

/* HC Frame Index Register(Address = 0x01C) */
#define HC_FRINDEX			       (*((PUINT32V)(USB_BASE_ADDR + 0x01C)))	    // RW(32h00000000), HC Frame Index Register

/* HC Periodic Frame List Base Address Register(Address = 0x024) */
#define HC_PERIODICLISTBASE		   (*((PUINT32V)(USB_BASE_ADDR + 0x024)))	    // RW(32h00000000), HC Periodic Frame List Base Address Register

/* HC Current Asynchronous List Address Register(Address = 0x028) */
#define HC_ASYNCHRONOUS  		   (*((PUINT32V)(USB_BASE_ADDR + 0x028)))	    // RW(32h00000000), HC Current Asynchronous List Address Register

/* HC Port Status and Control Register(Address = 0x030) */
#define HC_PORTSC			       (*((PUINT32V)(USB_BASE_ADDR + 0x030)))	    // RW(32h00000000), HC Port Status and Control Register

/* HC Miscellaneous Register(Address = 0x040) */
#define HC_MISCELLANEOUS           (*((PUINT32V)(USB_BASE_ADDR + 0x040)))	    // RW(32h00000181), HC Miscellaneous Register

/* HC Full-Speed(FS) EOF1 Timing Point Register(Address = 0x044) */
#define HC_FS_EOF1_T_POINT    	   (*((PUINT32V)(USB_BASE_ADDR + 0x044)))	    // RW(32h00000000), HC Full-Speed(FS) EOF1 Timing Point Register

/* HC High-Speed(HS) EOF1 Timing Point Register(Address = 0x048) */
#define HC_HS_EOF1_T_POINT    	   (*((PUINT32V)(USB_BASE_ADDR + 0x048)))	    // RW(32h00000000), HC High-Speed(HS) EOF1 Timing Point Register

/**********************************************************************************************************************************************/
/**************************  On-The-Go Controller Registers(Address = 0x080---0x0BF) ************************* */

/* OTG Control Status Register(Address = 0x080) */
#define OTG_CONTROL_STATUS         (*((PUINT32V)(USB_BASE_ADDR + 0x080)))	    // RW(32h00310020), OTG Control Status Register

/* OTG Interrupt Status Register(Address = 0x084) */
#define OTG_INT_STATUS         	   (*((PUINT32V)(USB_BASE_ADDR + 0x084)))	    // RW(32h00000040), OTG Interrupt Status Register

/* OTG Interrupt Enable Register(Address = 0x088) */
#define OTG_INT_EBABLE         	   (*((PUINT32V)(USB_BASE_ADDR + 0x088)))	    // RW(32h00000000), OTG Interrupt Enable Register

/**********************************************************************************************************************************************/
/**************************  Global Controller Registers(Address = 0x0C0---0x0FF) ************************* */

/* Global HC/OTG/DEV Interrupt Status Register(Address = 0x0C0) */
#define USB_GL_INT_STATUS          (*((PUINT32V)(USB_BASE_ADDR + 0x0C0)))	    // RW(32h00000000), Global HC/OTG/DEV Interrupt Status Register
#define  RB_HC_INT    		  	   (1 << 2)                      		        // RWC(1b0), HC Interrupt
#define  RB_OTG_INT    		  	   (1 << 1)                      		   		// RWC(1b0), OTG Interrupt
#define  RB_DEV_INT    		  	   (1 << 0)                      		   		// RWC(1b0), Device Interrupt

/* Global Mask of HC/OTG/DEV Interrupt Register(Address = 0x0C4) */
#define USB_GL_MASK_INT            (*((PUINT32V)(USB_BASE_ADDR + 0x0C4)))	    // RW(32h00000000), Global Mask of HC/OTG/DEV Interrupt Register

/**********************************************************************************************************************************************/
/**************************  Device Controller Registers(Address = 0x100---0x1FF) ************************* */

/* Device Main Control Register(Address = 0x100) */
#define USB_DEV_CONTROL            (*((PUINT32V)(USB_BASE_ADDR + 0x100)))	    // RW(32h00000020), Device Main Control Register
#define  RB_FORCE_FS      		   (1 << 9)                      		   		// RW(1b0), Force the devcie to full_speed
#define  RB_HS_EN      		   	   (1 << 6)                      		   		// RO(1b0), High_Speed Status
#define  RB_CHIP_EN      		   (1 << 5)                      		   		// RW(1b1), Chip Enable
#define  RB_SFRST      		   	   (1 << 4)                      		   		// RW(1b0), Device Software Reset
#define  RB_GOSUSP      		   (1 << 3)                      		   		// RW(1b0), Go Suspend
#define  RB_GLINT_EN      		   (1 << 2)                      		   		// RW(1b0), Global Interrupt Enable
#define  RB_HALF_SPEED    		   (1 << 1)                      		   		// RW(1b0), Half Speed Enable
#define  RB_CAP_RMWAKUP    		   (1 << 0)                      		   		// RW(1b0), Capability of Remote Wakeup

