Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/CH563USBSFR.H
/* Device Address Register(Address = 0x104) */
#define USB_DEV_ADDRESS            (*((PUINT32V)(USB_BASE_ADDR + 0x104)))	    // RW(32h00000000), Device Address Register
#define  RB_AFT_CONF    		   (1 << 7)                      		   		// RW(1b0), After Set Configuration

/* Device Test Register(Address = 0x108) */
#define USB_DEV_TEST          	   (*((PUINT32V)(USB_BASE_ADDR + 0x108)))	    // RW(32h00000000), Device Test Register
#define  RB_DISGENSOF    		   (1 << 6)                      		   		// RW(1b0), Disable the generation of SOF
#define  RB_TST_MOD    		   	   (1 << 5)                      		  	 	// RW(1b0), Test Mode
#define  RB_TST_DISTOG    		   (1 << 4)                      		   		// RW(1b0), Disable Toggle Sequence
#define  RB_TST_DISCRC    		   (1 << 3)                      		   		// RW(1b0), Disable CRC
#define  RB_TST_CLREA    		   (1 << 2)                      		   		// RW(1b0), Clear External Side Address
#define  RB_TST_LPCX    		   (1 << 1)                      		   		// RW(1b0), Loop-back Test for Control Endopint
#define  RB_TST_CLRFF    		   (1 << 0)                      		   		// RW(1b0), Clear FIFO

/* Device SOF Frame Number Register(Address = 0x10C) */
#define USB_DEV_SOF_NUM            (*((PUINT32V)(USB_BASE_ADDR + 0x10C)))	    // RO(32h00000000), Device SOF Frame Number Register

/* Device SOF Mask Timer Register(Address = 0x110) */
#define USB_DEV_SOF_MASKTIMER      (*((PUINT32V)(USB_BASE_ADDR + 0x110)))	    // RW(32h0000044C), Device SOF Mask Timer Register

/* PHY Test Mode Selector Register(Address = 0x114) */
#define USB_PHY_TEST_MODE          (*((PUINT32V)(USB_BASE_ADDR + 0x114)))	    // RW(32h00000000), PHY Test Mode Selector Register
#define  RB_TST_PKT    		   	   (1 << 4)                      		   		// RW(1b0), Test Mode for Packet
#define  RB_TST_SE0NAK    		   (1 << 3)                      		   		// RW(1b0), 
#define  RB_TST_KSTA    		   (1 << 2)                      		   		// RW(1b0), 
#define  RB_TST_JSTA    		   (1 << 1)                      		   		// RW(1b0), 
#define  RB_UNPLUG    		   	   (1 << 0)                      		   		// RW(1b0), 

/* Device Vendor-Specific I/O Control Register(Address = 0x118) */
#define USB_DEV_VCS_CONTROL        (*((PUINT32V)(USB_BASE_ADDR + 0x118)))	    // RW(32h00000020), Device Vendor-Specific I/O Control Register

/* Device CX Configuration Status Register(Address = 0x11C) */
#define USB_DEV_CX_CONF_STATUS     (*((PUINT32V)(USB_BASE_ADDR + 0x11C)))	   	// RO(), Device CX Configuration Status Register

/* Device CX Configuration and FIFO Empty Status Register(Address = 0x120) */
#define USB_DEV_CX_CONF_FIFO_STATUS (*((PUINT32V)(USB_BASE_ADDR + 0x120)))	    // RW(32h00000F20), Device CX Configuration and FIFO Empty Status Register
#define  RB_CX_EMP    		   	   (1 << 5)                      		   		// RO(1b1), CX FIFO is Empty
#define  RB_CX_FUL    		   	   (1 << 4)                      		   		// RO(1b0), CX FIFO is Full
#define  RB_CX_CLR    		   	   (1 << 3)                      		   		// RW(1b0), Clear CX FIFO Data
#define  RB_CX_STL    		   	   (1 << 2)                      		   		// RW(1b0), Stall CX
#define  RB_TST_PKDONE    		   (1 << 1)                      		   		// RW(1b0), Dtat Transfer is Done for Test Packet
#define  RB_DONE    		   	   (1 << 0)                      		   		// RW(1b0), Dtat Transfer is Done for CX

/* Device Idle Counter Register(Address = 0x124) */
#define USB_DEV_IDLE_COUNTER 	   (*((PUINT32V)(USB_BASE_ADDR + 0x124)))	    // RW(32h00000000), Device Idle Counter Register

/* Device Mask of Interrupt Grop Register(Address = 0x130) */
#define USB_DEV_MASK_INT_GROP 	   (*((PUINT32V)(USB_BASE_ADDR + 0x130)))	    // RW(32h00000000), Device Mask of Interrupt Grop Register
#define  RB_MINT_G2    		   	   (1 << 2)                      		   		// RW(1b0), Mask of interrupt of source group 2
#define  RB_MINT_G1    		   	   (1 << 1)                      		   		// RW(1b0), Mask of interrupt of source group 1
#define  RB_MINT_G0    		   	   (1 << 0)                      		   		// RW(1b0), Mask of interrupt of source group 0

/* Device Mask of Interrupt Source Grop 0 Register(Address = 0x134) */
#define USB_DEV_MASK_INT_GROP0 	   (*((PUINT32V)(USB_BASE_ADDR + 0x134)))	    // RW(32h00000000), Device Mask of Interrupt Source Grop 0 Register
#define  RB_MCX_COMABORT_INT       (1 << 5)                      		   		// RW(1b0), Mask interrupt of the control transfer command abort
#define  RB_MCX_COMFAIL_INT        (1 << 4)                      		   		// RW(1b0), Mask interrupt of the host emits extra IN or OUT data interrupt bit
#define  RB_MCX_COMEND             (1 << 3)                      		   		// RW(1b0), Mask the host end of a command(Entering the status stage) interrupt bit
#define  RB_MCX_OUT_INT            (1 << 2)                      		   		// RW(1b0), Mask the interrupt bits of endpoint 0 for OUT
#define  RB_MCX_IN_INT             (1 << 1)                      		   		// RW(1b0), Mask the interrupt bits of endpoint 0 for IN
#define  RB_MCX_SETUP_INT          (1 << 0)                      		   		// RW(1b0), Mask endpoint 0 setup data received interrupt bit

/* Device Mask of Interrupt Source Grop 1 Register(Address = 0x138) */
#define USB_DEV_MASK_INT_GROP1 	   (*((PUINT32V)(USB_BASE_ADDR + 0x138)))	    // RW(32h00000000), Device Mask of Interrupt Source Grop 1 Register
#define  RB_MF3_IN_INT             (1 << 19)                      		   		// RW(1b0), Mask the IN interrupt bits of FIFO 3
#define  RB_MF2_IN_INT             (1 << 18)                      		   		// RW(1b0), Mask the IN interrupt bits of FIFO 2
#define  RB_MF1_IN_INT             (1 << 17)                      		   		// RW(1b0), Mask the IN interrupt bits of FIFO 1
#define  RB_MF0_IN_INT             (1 << 16)                      		   		// RW(1b0), Mask the IN interrupt bits of FIFO 0
#define  RB_MF3_SPK_INT            (1 << 7)                      		   		// RW(1b0), Mask the Short Packet interrupt of FIFO 3
#define  RB_MF3_OUT_INT            (1 << 6)                      		   		// RW(1b0), Mask the OUT interrupt of FIFO 3
#define  RB_MF2_SPK_INT            (1 << 5)                      		   		// RW(1b0), Mask the Short Packet interrupt of FIFO 2
#define  RB_MF2_OUT_INT            (1 << 4)                      		   		// RW(1b0), Mask the OUT interrupt of FIFO 2
#define  RB_MF1_SPK_INT            (1 << 3)                      		   		// RW(1b0), Mask the Short Packet interrupt of FIFO 1
#define  RB_MF1_OUT_INT            (1 << 2)                      		   		// RW(1b0), Mask the OUT interrupt of FIFO 1
#define  RB_MF0_SPK_INT            (1 << 1)                      		   		// RW(1b0), Mask the Short Packet interrupt of FIFO 0
#define  RB_MF0_OUT_INT            (1 << 0)                      		   		// RW(1b0), Mask the OUT interrupt of FIFO 0

/* Device Mask of Interrupt Source Grop 2 Register(Address = 0x13C) */
#define USB_DEV_MASK_INT_GROP2 	   (*((PUINT32V)(USB_BASE_ADDR + 0x13C)))	    // RW(32h00000000), Device Mask of Interrupt Source Grop 2 Register
#define  RB_MDEV_WAKEUP_BYBUS      (1 << 10)                      		   		// RW(1b0), Mask Dev_Wakeup_byVBUS interrupt 
#define  RB_MDEV_IDLE      		   (1 << 9)                      		   		// RW(1b0), Mask Dev_Idle interrupt
#define  RB_MDMA_ERROR     		   (1 << 8)                      		   		// RW(1b0), Mask DMA Error interrupt
#define  RB_MDMA_CMPLT     		   (1 << 7)                      		   		// RW(1b0), Mask DMA Completion interrupt
#define  RB_MRX0BYTE_INT     	   (1 << 6)                      		   		// RW(1b0), Mask Received Zero-length Data Packet interrupt
#define  RB_MTX0BYTE_INT     	   (1 << 5)                      		   		// RW(1b0), Mask Transferred Zero-length Data Packet interrupt
#define  RB_MSEQ_ABORT_INT     	   (1 << 4)                      		   		// RW(1b0), Mask ISO Sequential Abort interrupt
#define  RB_MSEQ_ERR_INT     	   (1 << 3)                      		   		// RW(1b0), Mask ISO Sequential Error interrupt
#define  RB_MRESMQ_INT       	   (1 << 2)                      		   		// RW(1b0), Mask Resume interrupt
#define  RB_MSUSP_INT       	   (1 << 1)                      		   		// RW(1b0), Mask Suspend interrupt
#define  RB_MUSBRST_INT       	   (1 << 0)                      		   		// RW(1b0), Mask USB Reset interrupt
	
/* Device Interrupt Grop Register(Address = 0x140) */
#define USB_DEV_INT_GROP 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x140)))	    // RO(32h00000000), Device Interrupt Grop Register
#define  RB_INT_G2    		   	   (1 << 2)                      		   		// RO(1b0), interrupt of source group 2
#define  RB_INT_G1    		   	   (1 << 1)                      		   		// RO(1b0), interrupt of source group 1
#define  RB_INT_G0    		   	   (1 << 0)                      		   		// RO(1b0), interrupt of source group 0

/* Device Interrupt Source Grop 0 Register(Address = 0x144) */
#define USB_DEV_INT_GROP0 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x144)))	    // RW(32h00000000), Device Interrupt Source Grop0 Register
#define  RB_CX_COMABORT_INT       (1 << 5)                      		   		// RW(1b0), interrupt of the control transfer command abort
#define  RB_CX_COMFAIL_INT        (1 << 4)                      		   		// RW(1b0), interrupt of the host emits extra IN or OUT data interrupt bit
#define  RB_CX_COMEND             (1 << 3)                      		   		// RW(1b0), the host end of a command(Entering the status stage) interrupt bit
#define  RB_CX_OUT_INT            (1 << 2)                      		   		// RW(1b0), the interrupt bits of endpoint 0 for OUT
#define  RB_CX_IN_INT             (1 << 1)                      		   		// RW(1b0), the interrupt bits of endpoint 0 for IN
#define  RB_CX_SETUP_INT          (1 << 0)                      		   		// RW(1b0), endpoint 0 setup data received interrupt bit

/* Device Interrupt Source Grop 1 Register(Address = 0x148) */
#define USB_DEV_INT_GROP1 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x148)))	    // RO(32h00000000), Device Interrupt Source Grop1 Register
#define  RB_F3_IN_INT             (1 << 19)                      		   		// RW(1b0), the IN interrupt bits of FIFO 3
#define  RB_F2_IN_INT             (1 << 18)                      		   		// RW(1b0), the IN interrupt bits of FIFO 2
#define  RB_F1_IN_INT             (1 << 17)                      		   		// RW(1b0), the IN interrupt bits of FIFO 1
#define  RB_F0_IN_INT             (1 << 16)                      		   		// RW(1b0), the IN interrupt bits of FIFO 0
#define  RB_F3_SPK_INT            (1 << 7)                      		   		// RW(1b0), the Short Packet interrupt of FIFO 3
#define  RB_F3_OUT_INT            (1 << 6)                      		   		// RW(1b0), the OUT interrupt of FIFO 3
#define  RB_F2_SPK_INT            (1 << 5)                      		   		// RW(1b0), the Short Packet interrupt of FIFO 2
#define  RB_F2_OUT_INT            (1 << 4)                      		   		// RW(1b0), the OUT interrupt of FIFO 2
#define  RB_F1_SPK_INT            (1 << 3)                      		   		// RW(1b0), the Short Packet interrupt of FIFO 1
#define  RB_F1_OUT_INT            (1 << 2)                      		   		// RW(1b0), the OUT interrupt of FIFO 1
#define  RB_F0_SPK_INT            (1 << 1)                      		   		// RW(1b0), the Short Packet interrupt of FIFO 0
#define  RB_F0_OUT_INT            (1 << 0)                      		   		// RW(1b0), the OUT interrupt of FIFO 0

/* Device Interrupt Source Grop 2 Register(Address = 0x14C) */
#define USB_DEV_INT_GROP2 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x14C)))	    // RW(32h00000000), Device Interrupt Source Grop2 Register
#define  RB_DEV_WAKEUP_BYBUS       (1 << 10)                      		   		// RW(1b0), Dev_Wakeup_byVBUS interrupt 
#define  RB_DEV_IDLE      		   (1 << 9)                      		   		// RW(1b0), Dev_Idle interrupt
#define  RB_DMA_ERROR     		   (1 << 8)                      		   		// RW(1b0), DMA Error interrupt
#define  RB_DMA_CMPLT     		   (1 << 7)                      		   		// RW(1b0), DMA Completion interrupt
#define  RB_RX0BYTE_INT     	   (1 << 6)                      		   		// RW(1b0), Received Zero-length Data Packet interrupt
#define  RB_TX0BYTE_INT     	   (1 << 5)                      		   		// RW(1b0), Transferred Zero-length Data Packet interrupt
#define  RB_ISO_SEQ_ABORT_INT      (1 << 4)                      		   		// RW(1b0), ISO Sequential Abort interrupt
#define  RB_ISO_SEQ_ERR_INT        (1 << 3)                      		   		// RW(1b0), ISO Sequential Error interrupt
#define  RB_RESMQ_INT       	   (1 << 2)                      		   		// RW(1b0), Resume interrupt
#define  RB_SUSP_INT       	   	   (1 << 1)                      		   		// RW(1b0), Suspend interrupt
#define  RB_USBRST_INT       	   (1 << 0)                      		   		// RW(1b0), USB Reset interrupt

/* Device Receive Zero-Length Data Packet Register(Address = 0x150) */
#define USB_DEV_RECV_0_LEN_PACK    (*((PUINT32V)(USB_BASE_ADDR + 0x150)))	    // RW(32h00000000), Device Receive Zero-Length Data Packet Register
#define  RB_RX0BYTE_EP8       	   (1 << 7)                      		   		// RW(1b0), Endpoint 8 receives a zero-length data packet
#define  RB_RX0BYTE_EP7       	   (1 << 6)                      		   		// RW(1b0), Endpoint 7 receives a zero-length data packet
#define  RB_RX0BYTE_EP6       	   (1 << 5)                      		   		// RW(1b0), Endpoint 6 receives a zero-length data packet
#define  RB_RX0BYTE_EP5       	   (1 << 4)                      		   		// RW(1b0), Endpoint 5 receives a zero-length data packet
#define  RB_RX0BYTE_EP4       	   (1 << 3)                      		   		// RW(1b0), Endpoint 4 receives a zero-length data packet
#define  RB_RX0BYTE_EP3       	   (1 << 2)                      		   		// RW(1b0), Endpoint 3 receives a zero-length data packet
#define  RB_RX0BYTE_EP2       	   (1 << 1)                      		   		// RW(1b0), Endpoint 2 receives a zero-length data packet
#define  RB_RX0BYTE_EP1       	   (1 << 0)                      		   		// RW(1b0), Endpoint 1 receives a zero-length data packet

/* Device Transfer Zero-Length Data Packet Register(Address = 0x154) */
#define USB_DEV_SEND_0_LEN_PACK    (*((PUINT32V)(USB_BASE_ADDR + 0x154)))	    // RW(32h00000000), Device Transfer Zero-Length Data Packet Register
#define  RB_TX0BYTE_EP8       	   (1 << 7)                      		   		// RW(1b0), Endpoint 8 transfers a zero-length data packet
#define  RB_TX0BYTE_EP7       	   (1 << 6)                      		   		// RW(1b0), Endpoint 7 transfers a zero-length data packet
#define  RB_TX0BYTE_EP6       	   (1 << 5)                      		   		// RW(1b0), Endpoint 6 transfers a zero-length data packet
#define  RB_TX0BYTE_EP5       	   (1 << 4)                      		   		// RW(1b0), Endpoint 5 transfers a zero-length data packet
#define  RB_TX0BYTE_EP4       	   (1 << 3)                      		   		// RW(1b0), Endpoint 4 transfers a zero-length data packet
#define  RB_TX0BYTE_EP3       	   (1 << 2)                      		   		// RW(1b0), Endpoint 3 transfers a zero-length data packet
#define  RB_TX0BYTE_EP2       	   (1 << 1)                      		   		// RW(1b0), Endpoint 2 transfers a zero-length data packet
#define  RB_TX0BYTE_EP1       	   (1 << 0)                      		   		// RW(1b0), Endpoint 1 transfers a zero-length data packet

/* Device Isochronous Sequential Error/Abort Register(Address = 0x158) */
#define USB_DEV_ISO_ERR_ABORT      (*((PUINT32V)(USB_BASE_ADDR + 0x158)))	    // RW(32h00000000), Device Isochronous Sequential Error/Abort Register
#define  RB_ISO_SEQ_ERR_EP8        (1 << 23)                      		   		// RW(1b0), Endpoint 8 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP7        (1 << 22)                      		   		// RW(1b0), Endpoint 7 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP6        (1 << 21)                      		   		// RW(1b0), Endpoint 6 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP5        (1 << 20)                      		   		// RW(1b0), Endpoint 5 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP4        (1 << 19)                      		   		// RW(1b0), Endpoint 4 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP3        (1 << 18)                      		   		// RW(1b0), Endpoint 3 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP2        (1 << 17)                      		   		// RW(1b0), Endpoint 2 encounters an Isochronous Sequential Error
#define  RB_ISO_SEQ_ERR_EP1        (1 << 16)                      		   		// RW(1b0), Endpoint 1 encounters an Isochronous Sequential Error
#define  RB_ISO_ABT_ERR_EP8        (1 << 7)                      		   		// RW(1b0), Endpoint 8 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP7        (1 << 6)                      		   		// RW(1b0), Endpoint 7 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP6        (1 << 5)                      		   		// RW(1b0), Endpoint 6 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP5        (1 << 4)                      		   		// RW(1b0), Endpoint 5 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP4        (1 << 3)                      		   		// RW(1b0), Endpoint 4 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP3        (1 << 2)                      		   		// RW(1b0), Endpoint 3 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP2        (1 << 1)                      		   		// RW(1b0), Endpoint 2 encounters an Isochronous Sequential abort
#define  RB_ISO_ABT_ERR_EP1        (1 << 0)                      		   		// RW(1b0), Endpoint 1 encounters an Isochronous Sequential abort

/* Device IN Endpoint 1 MaxPackSize Register(Address = 0x160) */
#define USB_DEV_EP1_IN_MAXPKS      (*((PUINT32V)(USB_BASE_ADDR + 0x160)))	    // RW(32h00000200), Device IN Endpoint 1 MaxPackSize Register
#define  RB_TX0BYTE_IEPx           (1 << 15)                      		   		// RW(1b0), Transfer a Zero-length Data Packet from Endpoint 1 to USB Host
#define  RB_RSTG_IEPx              (1 << 12)                      		   		// RW(1b0), Reset Toggle Sequence for IN Endpoint 1
#define  RB_STL_IEPx               (1 << 11)                      		   		// RW(1b0), Stall IN Endpoint 1

/* Device IN Endpoint 2 MaxPackSize Register(Address = 0x164) */
#define USB_DEV_EP2_IN_MAXPKS      (*((PUINT32V)(USB_BASE_ADDR + 0x164)))	    // RW(32h00000200), Device IN Endpoint 2 MaxPackSize Register

/* Device IN Endpoint 3 MaxPackSize Register(Address = 0x168) */
#define USB_DEV_EP3_IN_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x168)))	    // RW(32h00000200), Device IN Endpoint 3 MaxPackSize Register

/* Device IN Endpoint 4 MaxPackSize Register(Address = 0x16C) */
#define USB_DEV_EP4_IN_MAXPKS      (*((PUINT32V)(USB_BASE_ADDR + 0x16C)))	    // RW(32h00000200), Device IN Endpoint 4 MaxPackSize Register

/* Device IN Endpoint 5 MaxPackSize Register(Address = 0x170) */
#define USB_DEV_EP5_IN_MAXPKS  	   (*((PUINT32V)(USB_BASE_ADDR + 0x170)))	    // RW(32h00000200), Device IN Endpoint 5 MaxPackSize Register

