Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/CH563USBSFR.H
/* Device IN Endpoint 6 MaxPackSize Register(Address = 0x174) */
#define USB_DEV_EP6_IN_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x174)))	    // RW(32h00000200), Device IN Endpoint 6 MaxPackSize Register

/* Device IN Endpoint 7 MaxPackSize Register(Address = 0x178) */
#define USB_DEV_EP7_IN_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x178)))	    // RW(32h00000200), Device IN Endpoint 7 MaxPackSize Register

/* Device IN Endpoint 8 MaxPackSize Register(Address = 0x17C) */
#define USB_DEV_EP8_IN_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x17C)))	    // RW(32h00000200), Device IN Endpoint 8 MaxPackSize Register

/* Device OUT Endpoint 1 MaxPackSize Register(Address = 0x180) */
#define USB_DEV_EP1_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x180)))	    // RW(32h00000200), Device OUT Endpoint 1 MaxPackSize Register
#define  RB_RSTG_OEPx              (1 << 12)                      		   		// RW(1b0), Reset Toggle Sequence for OUT Endpoint 1
#define  RB_STL_OEPx               (1 << 11)                      		   		// RW(1b0), Stall OUT Endpoint 1

/* Device OUT Endpoint 2 MaxPackSize Register(Address = 0x184) */
#define USB_DEV_EP2_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x184)))	    // RW(32h00000200), Device OUT Endpoint 2 MaxPackSize Register

/* Device OUT Endpoint 3 MaxPackSize Register(Address = 0x188) */
#define USB_DEV_EP3_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x188)))	    // RW(32h00000200), Device OUT Endpoint 3 MaxPackSize Register

/* Device OUT Endpoint 4 MaxPackSize Register(Address = 0x18C) */
#define USB_DEV_EP4_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x18C)))	    // RW(32h00000200), Device OUT Endpoint 4 MaxPackSize Register

/* Device OUT Endpoint 5 MaxPackSize Register(Address = 0x190) */
#define USB_DEV_EP5_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x190)))	    // RW(32h00000200), Device OUT Endpoint 5 MaxPackSize Register

/* Device OUT Endpoint 6 MaxPackSize Register(Address = 0x194) */
#define USB_DEV_EP6_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x194)))	    // RW(32h00000200), Device OUT Endpoint 6 MaxPackSize Register

/* Device OUT Endpoint 7 MaxPackSize Register(Address = 0x198) */
#define USB_DEV_EP7_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x198)))	    // RW(32h00000200), Device OUT Endpoint 7 MaxPackSize Register

/* Device OUT Endpoint 8 MaxPackSize Register(Address = 0x19C) */
#define USB_DEV_EP8_OUT_MAXPKS 	   (*((PUINT32V)(USB_BASE_ADDR + 0x19C)))	    // RW(32h00000200), Device OUT Endpoint 8 MaxPackSize Register

/* Device Endpoint 1---4 Map Register(Address = 0x1A0) */
#define USB_DEV_EP1_4_MAP 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x1A0)))	    // RW(32h33333333), Device Endpoint 1---4 Map Register

/* Device Endpoint 5---8 Map Register(Address = 0x1A4) */
#define USB_DEV_EP5_8_MAP 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x1A4)))	    // RW(32h3FFFFFFF), Device Endpoint 5---8 Map Register

/* Device FIFO Map Register(Address = 0x1A8) */
#define USB_DEV_FIFO_MAP 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x1A8)))	    // RW(32h0F0F0F0F), Device FIFO Map Register

/* Device FIFO Configuration Register(Address = 0x1AC) */
#define USB_DEV_FIFO_CONFIG 	   (*((PUINT32V)(USB_BASE_ADDR + 0x1AC)))	    // RW(32h00000000), Device FIFO Configuration Register

/* Device FIFO 0 Instruction and Byte Count Register(Address = 0x1B0) */
#define USB_DEV_FIFO0_INFO 	   	   (*((PUINT32V)(USB_BASE_ADDR + 0x1B0)))	    // RW(32h00000000), Device FIFO 0 Instruction and Byte Count Register
#define  RB_FFRST 	               (1 << 12)                      		   		// RW(1b0),Reset FIFO x

/* Device FIFO 1 Instruction and Byte Count Register(Address = 0x1B4) */
#define USB_DEV_FIFO1_INFO 	       (*((PUINT32V)(USB_BASE_ADDR + 0x1B4)))	    // RW(32h00000000), Device FIFO 1 Instruction and Byte Count Register

/* Device FIFO 2 Instruction and Byte Count Register(Address = 0x1B8) */
#define USB_DEV_FIFO2_INFO 	       (*((PUINT32V)(USB_BASE_ADDR + 0x1B8)))	    // RW(32h00000000), Device FIFO 2 Instruction and Byte Count Register

/* Device FIFO 3 Instruction and Byte Count Register(Address = 0x1BC) */
#define USB_DEV_FIFO3_INFO 	       (*((PUINT32V)(USB_BASE_ADDR + 0x1BC)))	    // RW(32h00000000), Device FIFO 3 Instruction and Byte Count Register

/* Device DMA Target FIFO Number Register(Address = 0x1C0) */
#define USB_DEV_DMA_TARGET_FIFO    (*((PUINT32V)(USB_BASE_ADDR + 0x1C0)))	    // RW(32h00000000), Device DMA Target FIFO Number Register

/* Device DMA Controller Parameter Setting 1 Register(Address = 0x1C8) */
#define USB_DEV_DMA_SET1    	   (*((PUINT32V)(USB_BASE_ADDR + 0x1C8)))	    // RW(32h00000000), Device DMA Controller Parameter Setting 1 Register
#define  RB_DEVPHY_SUSPEND         (1 << 31)                      		   		// RW(1b0), Device Transceiver Suspend Mode
#define  RB_CLRFIFO_DMAABORT       (1 << 4)                      		   		// RW(1b0), Clear FIFO when DMA_ABORT
#define  RB_DMA_ABORT              (1 << 3)                      		   		// RW(1b0), DMA ABORT
#define  RB_DMA_IO                 (1 << 2)                      		   		// RW(1b0), DMA I/O to I/O
#define  RB_DMA_TYPE               (1 << 1)                      		   		// RW(1b0), DMA Type
#define  RB_DMA_START              (1 << 0)                      		   		// RW(1b0), DMA Start

/* Device DMA Controller Parameter Setting 2 Register(Address = 0x1CC) */
#define USB_DEV_DMA_SET2    	   (*((PUINT32V)(USB_BASE_ADDR + 0x1CC)))	    // RW(32h00000000), Device DMA Controller Parameter Setting 2 Register

/* Device DMA Controller Parameter Setting 3 Register(Address = 0x1D0) */
#define USB_DEV_DMA_SET3    	   (*((PUINT32V)(USB_BASE_ADDR + 0x1D0)))	    // RO(32h00000000), Device DMA Controller Parameter Setting 3 Register
#define USB_DEV_SETUP_CMD_RPORT    (*((PUINT32V)(USB_BASE_ADDR + 0x1D0)))	    // RO(32h00000000), Device DMA Controller Parameter Setting 3 Register


#ifdef __cplusplus
}
#endif

#endif

/* ********************************************************************************************************************* */
